src/cf/InformationRegisters/СвязиАдресатКонтактCRM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СвязиАдресатКонтактCRM</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Адресат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдресатыПисем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтактCRM</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтактПисьма</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТипыПолучателейЭлектронногоПисьма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыПолучателейЭлектронногоПисьма</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кому</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Копия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкрытаяКопия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтКого</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ЭлектроннаяПочтаУНФВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// См. ЭлектроннаяПочтаУНФ.ПодготовленныеЭлектронныеАдресаПолучателей
Функция ПодготовленныеЭлектронныеАдресаПолучателей(МассивОбъектов) Экспорт
	
	Возврат ЭлектроннаяПочтаУНФ.ПодготовленныеЭлектронныеАдресаПолучателей(МассивОбъектов);
	
КонецФункции

// См. ЭлектроннаяПочтаУНФ.ИспользуетсяРаботаССобытиями
Функция ИспользуетсяРаботаССобытиями() Экспорт
	
	Возврат ЭлектроннаяПочтаУНФ.ИспользуетсяРаботаССобытиями();
	
КонецФункции

// Вызывает Справочники.КонтактныеФормыGoogle.ПодготовитьКонтактнуюИнформациюПоДаннымКФ
//
// Параметры:
//  Событие - ДокументСсылка.Событие - письмо
//  КакСвязаться - Строка - электронная почта, телефон
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - см Справочники.КонтактныеФормыGoogle.ПодготовитьКонтактнуюИнформациюПоДаннымКФ
//  Неопределено - см Справочники.КонтактныеФормыGoogle.ПодготовитьКонтактнуюИнформациюПоДаннымКФ
//
Функция ПодготовитьКонтактнуюИнформациюПоДаннымКФ(Событие, КакСвязаться) Экспорт
	Возврат Справочники.КонтактныеФормыGoogle.ПодготовитьКонтактнуюИнформациюПоДаннымКФ(Событие, КакСвязаться);
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗначениеРеквизитовСобытияДляОтвета(Знач Письмо, Знач УникальныйИдентификатор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументСобытие.Ссылка КАК Ссылка,
		|	ДокументСобытие.ТипСобытия КАК ТипСобытия,
		|	ДокументСобытие.НачалоСобытия КАК НачалоСобытия,
		|	ДокументСобытие.СписокУчастников КАК СписокУчастников,
		|	ДокументСобытие.Тема КАК Тема,
		|	ДокументСобытие.Содержание КАК Содержание,
		|	ДокументСобытие.СодержаниеHTML КАК СодержаниеHTML,
		|	ДокументСобытие.КартинкиHTML КАК КартинкиHTML,
		|	ДокументСобытие.ИсточникПривлечения КАК ИсточникПривлечения,
		|	ДокументСобытие.ЗагрузитьПриОткрытии КАК ЗагрузитьПриОткрытии,
		|	ДокументСобытие.УчетнаяЗапись КАК УчетнаяЗапись,
		|	ДокументСобытие.ВходящееИсходящееСобытие КАК ВходящееИсходящееСобытие,
		|	СобытиеУчастники.ТипПолучателяЭлектронногоПисьма КАК ТипПолучателяЭлектронногоПисьма,
		|	СобытиеУчастники.КакСвязаться КАК КакСвязаться,
		|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(СвязиАдресатКонтактCRM.КонтактCRM), ПРЕДСТАВЛЕНИЕ(СобытиеУчастники.Контакт)) КАК КонтактПредставление,
		|	ЕСТЬNULL(СвязиАдресатКонтактCRM.КонтактCRM, СобытиеУчастники.Контакт) КАК КонтактCRM,
		|	УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты КАК УчетнаяЗаписьАдресЭлектроннойПочты,
		|	УчетныеЗаписиЭлектроннойПочты.Представление КАК УчетнаяЗаписьПредставление
		|ИЗ
		|	Документ.Событие КАК ДокументСобытие
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Событие.Участники КАК СобытиеУчастники
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиАдресатКонтактCRM КАК СвязиАдресатКонтактCRM
		|			ПО СобытиеУчастники.Контакт = СвязиАдресатКонтактCRM.Адресат
		|		ПО ДокументСобытие.Ссылка = СобытиеУчастники.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
		|		ПО ДокументСобытие.УчетнаяЗапись = УчетныеЗаписиЭлектроннойПочты.Ссылка
		|ГДЕ
		|	ДокументСобытие.Ссылка = &Ссылка
		|ИТОГИ
		|	МАКСИМУМ(УчетнаяЗаписьАдресЭлектроннойПочты),
		|	МАКСИМУМ(УчетнаяЗаписьПредставление)
		|ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Письмо);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Выборка.Следующий();
	
	Результат = Новый Структура;
	
	Результат.Вставить("Ссылка", Письмо);
	Результат.Вставить("ТипСобытия", Выборка.ТипСобытия);
	Результат.Вставить("НачалоСобытия", Выборка.НачалоСобытия);
	Результат.Вставить("СписокУчастников", Выборка.СписокУчастников);
	Результат.Вставить("Тема", Выборка.Тема);
	Результат.Вставить("Содержание", Выборка.Содержание);
	Результат.Вставить("СодержаниеHTML", Выборка.СодержаниеHTML);
	Результат.Вставить("КартинкиHTML", Выборка.КартинкиHTML);
	Результат.Вставить("ИсточникПривлечения", Выборка.ИсточникПривлечения);
	Результат.Вставить("ЗагрузитьПриОткрытии", Выборка.ЗагрузитьПриОткрытии);
	Результат.Вставить("УчетнаяЗапись", Выборка.УчетнаяЗапись);
	Результат.Вставить("ВходящееИсходящееСобытие", Выборка.ВходящееИсходящееСобытие);
	
	ОтКого = Неопределено;
	
	ВыборкаУчастников = Выборка.Выбрать();
	Пока ВыборкаУчастников.Следующий() Цикл
		
		Если ВыборкаУчастников.ТипПолучателяЭлектронногоПисьма = Перечисления.ТипыПолучателейЭлектронногоПисьма.ОтКого Тогда
			
			Если ОтКого = Неопределено Тогда
				
				ОтКого = Новый Структура;
				ОтКого.Вставить("Ссылка", ВыборкаУчастников.КонтактCRM);
				ОтКого.Вставить("Представление", ВыборкаУчастников.КонтактПредставление);
				ОтКого.Вставить("КакСвязаться", ВыборкаУчастников.КакСвязаться);
				
				Продолжить;
				
			КонецЕсли;
			
			ВажностьОтКого = ЭлектроннаяПочтаУНФ.ВажностьОтображенияКонтакта(ОтКого.Ссылка);
			ВажностьДубляОтправителя = ЭлектроннаяПочтаУНФ.ВажностьОтображенияКонтакта(ВыборкаУчастников.Ссылка);
			Если ВажностьДубляОтправителя > ВажностьОтКого Тогда
				
				ОтКого.Вставить("Ссылка", ВыборкаУчастников.КонтактCRM);
				ОтКого.Вставить("Представление", ВыборкаУчастников.КонтактПредставление);
				ОтКого.Вставить("КакСвязаться", ВыборкаУчастников.КакСвязаться);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОтКого = Неопределено Тогда
		ОтКого = СтрШаблон("%1 <%2>", Выборка.УчетнаяЗаписьПредставление, Выборка.УчетнаяЗаписьАдресЭлектроннойПочты);
	Иначе
		ОтКого = СтрШаблон("%1 <%2>", ОтКого.Представление, ОтКого.КакСвязаться);
	КонецЕсли;
	Результат.Вставить("ОтКого", ОтКого);
	
	Вложения = Документы.Событие.ВложенияСобытия(Письмо, УникальныйИдентификатор);
	Результат.Вставить("Вложения", Вложения);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьСобытиеССодержаниемИзПредпросмотра(Знач Ссылка, Знач ТекстПисьма) Экспорт
	
	УдалитьШапкуСМетаданными(ТекстПисьма);
	
	Объект = Ссылка.ПолучитьОбъект();
	Объект.Заблокировать();
	Объект.СодержаниеHTML = ТекстПисьма;
	Объект.Записать();
	
КонецПроцедуры

Функция СсылкаИзНавигационной(Знач НавигационнаяСсылка) Экспорт
	
	ПерваяТочка = СтрНайти(НавигационнаяСсылка, "e1cib/data/");
	Если ПерваяТочка = 0 Тогда
		Возврат НавигационнаяСсылка;
	КонецЕсли;
	
	ВтораяТочка = СтрНайти(НавигационнаяСсылка, "?ref=");
	
	ПредставлениеТипа   = Сред(НавигационнаяСсылка, ПерваяТочка + 11, ВтораяТочка - ПерваяТочка - 11);
	ШаблонЗначения = ЗначениеВСтрокуВнутр(ПредопределенноеЗначение(ПредставлениеТипа + ".ПустаяСсылка"));
	ЗначениеСсылки = СтрЗаменить(ШаблонЗначения, "00000000000000000000000000000000", Сред(НавигационнаяСсылка, ВтораяТочка + 5));
	Возврат ЗначениеИзСтрокиВнутр(ЗначениеСсылки);
	
КонецФункции

Функция ЕстьДоступныеШаблоны(ДляПисем, ПредметШаблона) Экспорт
	Возврат ШаблоныСообщенийУНФ.ЕстьДоступныеШаблоны(ДляПисем, ПредметШаблона);
КонецФункции

Процедура ВыбратьПолучателей(ОбъектыОтправки, ПараметрыОтправкиПФ) Экспорт
	
	МассивОбъектов = ОбщегоНазначения.СкопироватьРекурсивно(ОбъектыОтправки);
	ПараметрыОтправкиПФ.Получатели = ЭлектроннаяПочтаУНФ.ПодготовленныеНомераТелефоновПолучателей(МассивОбъектов);
	
КонецПроцедуры

Функция ОтправитьПечатныеФормыПоПочте(
	Знач ОбъектыОтправки, Знач ИмяФормыОбъектаКоманды, Знач УникальныйИдентификатор) Экспорт
	
	Возврат ЭлектроннаяПочтаУНФ.ОтправитьПечатныеФормыПоПочте(
	ОбъектыОтправки, ИмяФормыОбъектаКоманды, УникальныйИдентификатор);
	
КонецФункции

Функция ОтправитьПисьмоСПечатнымиФормами(
	Знач ИдентификаторыКомандПечати,
	Знач ОбъектыОтправки,
	Знач УникальныйИдентификатор,
	Знач ИмяФормыОбъектаПечати,
	Знач НастройкиВложений = Неопределено) Экспорт
	
	Возврат ЭлектроннаяПочтаУНФ.ОтправитьПисьмоСПечатнымиФормами(
	ИдентификаторыКомандПечати,
	ОбъектыОтправки,
	УникальныйИдентификатор,
	ИмяФормыОбъектаПечати,
	НастройкиВложений);
	
КонецФункции

Функция ПолучитьФайлыПодписейИПоместитьВАрхив(
	Знач РезультатПодписания, Знач НастройкиСохранения, Знач УникальныйИдентификатор) Экспорт
	
	Возврат ЭлектроннаяПочтаУНФ.ПолучитьФайлыПодписейИПоместитьВАрхив(
	РезультатПодписания, НастройкиСохранения, УникальныйИдентификатор);
	
КонецФункции

// Создание контакта на основании события.
// 
// Параметры:
//  Событие - ДокументСсылка.Событие - Событие
// 
// Возвращаемое значение:
//  Структура - Создание контакта на основании события:
//  * ПервыйУчастник - Неопределено, Структура - :
//   ** Контакт - Неопределено - 
//   ** КакСвязаться - Строка - 
//  * ВторойУчастник - Неопределено, Структура - :
//   ** Контакт - Неопределено - 
//   ** КакСвязаться - Строка - 
//  * ИсточникПривлечения - СправочникСсылка.ИсточникиПривлеченияПокупателей - 
//
Функция СозданиеКонтактаНаОснованииСобытия(Событие) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПервыйУчастник");
	Результат.Вставить("ВторойУчастник");
	Результат.Вставить("ИсточникПривлечения", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Событие, "ИсточникПривлечения"));
	
	УчастникиСобытия = ПервыеУчастникиСобытия(Событие);
	Если УчастникиСобытия.Количество() > 0 Тогда
		Результат.ПервыйУчастник = УчастникиСобытия[0];
	КонецЕсли;
	Если УчастникиСобытия.Количество() > 1 Тогда
		Результат.ВторойУчастник = УчастникиСобытия[1];
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат Результат;
	
КонецФункции

Функция ВыгрузитьДанныеДляТехническойПоддержки(УникальныйИдентификатор, ПараметрыВыгрузки) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Электронная почта. Получение файлов для технической поддержки.'");
	
	ИмяМетода = "ЭлектроннаяПочтаУНФ.ВыгрузитьДанныеДляТехническойПоддержки";
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяМетода, ПараметрыВыгрузки);
	
КонецФункции

Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	
КонецФункции

Функция ВключитьВыключитьЛогНаФормеУчетнойЗаписи(УчетнаяЗапись) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЛогированиеВключено", Ложь);
	
	ЛогированиеБылоВключено = ОбменСВнешнимиСистемамиЛогирование.ЛогированиеВключено(УчетнаяЗапись);
	ЛогированиеВключено = Не ЛогированиеБылоВключено;
	
	ОбменСВнешнимиСистемамиЛогирование.ЛогированиеВключеноЗначениеУстановить(УчетнаяЗапись, ЛогированиеВключено);
	
	Результат.ЛогированиеВключено = ЛогированиеВключено;
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УдалитьШапкуСМетаданными(ТекстHTML)
	
	НачалоШапки = СтрНайти(ТекстHTML, "<!-- Начало шапки -->");
	Если НачалоШапки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КонецШапки = СтрНайти(ТекстHTML, "<!-- Конец шапки -->");
	Если НачалоШапки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КонецШапки = КонецШапки + СтрДлина("<!-- Конец шапки -->");
	
	КонтентДоШапки = Сред(ТекстHTML, 1, НачалоШапки - 1);
	КонтентПослеШапки = Сред(ТекстHTML, КонецШапки);
	
	ТекстHTML = СтрШаблон("%1%2", КонтентДоШапки, КонтентПослеШапки);
	
КонецПроцедуры

Функция ПервыеУчастникиСобытия(Событие, КоличествоУчастников = 2)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	СобытиеУчастники.КакСвязаться,
		|	СобытиеУчастники.Контакт
		|ИЗ
		|	Документ.Событие.Участники КАК СобытиеУчастники
		|ГДЕ
		|	СобытиеУчастники.Ссылка = &Ссылка";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "2", КоличествоУчастников);
	Запрос.УстановитьПараметр("Ссылка", Событие);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДанныеУчастника = Новый Структура;
		ДанныеУчастника.Вставить("Контакт", Неопределено);
		ДанныеУчастника.Вставить("КакСвязаться", "");
		ЗаполнитьЗначенияСвойств(ДанныеУчастника, Выборка);
		
		Результат.Добавить(ДанныеУчастника);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
